In [2]:
import pandas as pd

# pd is the alias name
import numpy as np

### Pandas
We have 2 types of data in Pandas

<b> 1) Series</b>
a) It is equivalent to a single column of data<br>
b) Series will bear index. There can be multiple indexes for a series<br> 
c) By default the index generated will start from 0 towards positive.<br>

<b> 2) DataFrame</b><br>
a) Data Represented into Rows and Columns is called DataFrame.(Tabular Structure)<br>
b) DataFrame will bear index. There can be multiple indexes for a DataFrame.<br>
c) By default the index generated will start from 0 towards positive.<br>

Note<br>
<b>A dataframe can be made up of a single column but a series cannot bear multiple columns</b>

### Create a DataFrame

#### 1) Using Dictionary

In [9]:
d = {'Name':['Varun','Kartik','Shweta','Divya','Aman','Keshav'],
     'Age':[23,24,25,31,29,33],
     'Salary':[31500,28000,37500,43000,49000,54000]
    }
print(d)

{'Name': ['Varun', 'Kartik', 'Shweta', 'Divya', 'Aman', 'Keshav'], 'Age': [23, 24, 25, 31, 29, 33], 'Salary': [31500, 28000, 37500, 43000, 49000, 54000]}

In [12]:
df = pd.DataFrame(d)
df

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000
4    Aman   29   49000
5  Keshav   33   54000

In [8]:
df.shape

(6, 3)

In [13]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

#### DataFrame Functions
<b>1) head(n) - </b><br>
Return top n rows of the dataframe. If n is not mentioned, it returns top 5 rows 

<b>2) tail(n) -  </b><br>
Return bottom n rows of the dataframe. If n is not mentioned, it returns bottom 5 rows

<b>3) sample(n) - </b><br>
Return random n rows of the dataframe. If n is not mentioned it returns random 1 row

In [14]:
df

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000
4    Aman   29   49000
5  Keshav   33   54000

In [18]:
df.head(4)

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000

In [20]:
df.tail(3)

     Name  Age  Salary
3   Divya   31   43000
4    Aman   29   49000
5  Keshav   33   54000

In [25]:
df.sample()

     Name  Age  Salary
5  Keshav   33   54000

In [30]:
df.sample(3)

     Name  Age  Salary
4    Aman   29   49000
0   Varun   23   31500
5  Keshav   33   54000

#### How to Fetch column values from DataFarme

In [31]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

#### Fetching single column

In [35]:
d1 = df['Salary']
print(d1)
print(type(d1))

0    31500
1    28000
2    37500
3    43000
4    49000
5    54000
Name: Salary, dtype: int64
<class 'pandas.core.series.Series'>

#### Fetching multiple columns

In [45]:
# select Salary,Age,name from df
d2 = df[['Salary','Age','Name','Age']]
d2

   Salary  Age    Name  Age
0   31500   23   Varun   23
1   28000   24  Kartik   24
2   37500   25  Shweta   25
3   43000   31   Divya   31
4   49000   29    Aman   29
5   54000   33  Keshav   33

In [38]:
print(type(d2))

<class 'pandas.core.frame.DataFrame'>

In [46]:
d3 = df[['Age']]
d3

   Age
0   23
1   24
2   25
3   31
4   29
5   33

In [47]:
print(type(d3))

<class 'pandas.core.frame.DataFrame'>

In [48]:
df.head()

     Name  Age  Salary
0   Varun   23   31500
1  Kartik   24   28000
2  Shweta   25   37500
3   Divya   31   43000
4    Aman   29   49000

In [49]:
df.dtypes

Name      object
Age        int64
Salary     int64
dtype: object

#### How to add aNe column to the DataFrame

In [51]:
print(df.columns)
print(df.shape)

Index(['Name', 'Age', 'Salary'], dtype='object')
(6, 3)

In [53]:
df['Dept'] = ['IT','Sales','Logistics','IT','Marketing','HR']

In [54]:
df.head(6)

     Name  Age  Salary       Dept
0   Varun   23   31500         IT
1  Kartik   24   28000      Sales
2  Shweta   25   37500  Logistics
3   Divya   31   43000         IT
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

#### Q) Find all the records where Salary >32000

In [56]:
r1 = df[df['Salary']>32000]
r1

     Name  Age  Salary       Dept
2  Shweta   25   37500  Logistics
3   Divya   31   43000         IT
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

#### Q) Fetch Name, Salary and Dept where Salary <40000

In [59]:
r2 = df[['Name','Salary','Dept']][df['Salary']<40000]
r2

     Name  Salary       Dept
0   Varun   31500         IT
1  Kartik   28000      Sales
2  Shweta   37500  Logistics

In [62]:
r3 = df[['Name','Salary','Dept']].query('Salary<40000')
r3

     Name  Salary       Dept
0   Varun   31500         IT
1  Kartik   28000      Sales
2  Shweta   37500  Logistics

#### Aggregate Functions - sum(),min(),max(),count(),mean(),median()

In [64]:
print('Max Salary',df['Salary'].max())
print('Min Salary',df['Salary'].min())
print('Sum Salary',df['Salary'].sum())
print('Mean Salary',df['Salary'].mean())
print('Median Salary',df['Salary'].median())
print('Count Salary',df['Salary'].count())

Max Salary 54000
Min Salary 28000
Sum Salary 243000
Mean Salary 40500.0
Median Salary 40250.0
Count Salary 6

#### Q) Find the employee details who earned max salary

In [ ]:
# df[54000]

In [67]:
r6 = df[df['Salary'] == df['Salary'].max()]
r6

     Name  Age  Salary Dept
5  Keshav   33   54000   HR

#### Q) Find the emp details whose Salary>35000 and Age<30

In [74]:
# r7 = df[(df['Salary']>35000) & (df['Age']<30)]
# r7
r8 = df.query('Salary>35000 and Age<30')
r8

     Name  Age  Salary       Dept
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing

In [73]:
r7 = df[df['Salary']>35000][df['Age']<30]
r7

<ipython-input-73-5df9b15983e6>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  r7 = df[df['Salary']>35000][df['Age']<30]

     Name  Age  Salary       Dept
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing

#### Q) Find all the emp details where Age<30 or dept is not IT

In [75]:
r9 = df[(df['Age']<30) | (df['Dept']!='IT')]
r9

     Name  Age  Salary       Dept
0   Varun   23   31500         IT
1  Kartik   24   28000      Sales
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

In [76]:
r10 = df.query("Age<30 or Dept!='IT'")
r10

     Name  Age  Salary       Dept
0   Varun   23   31500         IT
1  Kartik   24   28000      Sales
2  Shweta   25   37500  Logistics
4    Aman   29   49000  Marketing
5  Keshav   33   54000         HR

#### How to read data from .csv, .xlsx files?

pd.read_csv('a.csv')<br>
pd.read_xlsx('b.xlsx')

In [84]:
df2 = pd.read_csv('E:\Institute Curriculum\Imarticus_Data\SQL\Session1_dataset\dept.csv')
df2.head()

   D_ID  DName     centre     contact  assets  commission
0     1  SALES     Mumbai  111-737354      21        0.42
1     2  MARKT     Indore  111-324233      20        0.45
2     3    INV     Mumbai  111-334542      15        0.32
3     4     HR      Delhi  111-243432      24        0.56
4     5     IT  Bangalore  111-525346      13        0.18

In [78]:
df1 = pd.read_csv('SalesRetails.csv')
df1.head()

  Region    Sales    Profit
0    USA      13.08    4.56
1     UK     252.16   90.72
2     UK     193.28   54.08
3     UK      35.44    4.96
4     UK      71.60   11.44

In [79]:
df1.shape

(350, 3)

In [81]:
df1.columns

Index(['Region', '  Sales  ', 'Profit'], dtype='object')

In [82]:
df1['Sales']

KeyError: 'Sales'

#### Rename all the columns

In [83]:
df1.columns =['Region','Sales','Profit']
df1.columns

Index(['Region', 'Sales', 'Profit'], dtype='object')

In [85]:
df.shape

(6, 4)

In [86]:
df.columns

Index(['Name', 'Age', 'Salary', 'Dept'], dtype='object')

In [90]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Region  350 non-null    object
 1   Sales   350 non-null    float64
 2   Profit  350 non-null    float64
dtypes: float64(2), object(1)
memory usage: 8.3+ KB

In [94]:
df1.head()

  Region   Sales  Profit
0    USA   13.08    4.56
1     UK  252.16   90.72
2     UK  193.28   54.08
3     UK   35.44    4.96
4     UK   71.60   11.44

In [97]:
d1 = df1['Region'].value_counts()
d1

USA      187
UK       103
India     60
Name: Region, dtype: int64

In [98]:
print(type(d1))

<class 'pandas.core.series.Series'>

In [105]:
df1['Region'].unique()

array(['USA', 'UK', 'India'], dtype=object)

In [106]:
df1['Region'].nunique()

3